BaseKinoteatr/src/InformationRegisters/ПроданныеБилеты/ПроданныеБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроданныеБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Бронирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПодтверждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БронированиеВыкуплено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Зал</name>
    <type>
      <types>CatalogRef.Кинозалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Время</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BaseKinoteatr/src/CommonForms/ФормаВыбораМест/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВывестиВидСхемы();
	
КонецПроцедуры


&НаСервере
Процедура ВывестиВидСхемы()
	
	КоличествоМест = Параметры.Зал.СхемаЗала.КоличествоМестНаРяд;
	КоличествоРядов = Параметры.Зал.СхемаЗала.КоличествоРядов;
	
	СхемаЗала.Очистить();
		
	//получаем схему из ХранилищаЗначений, если она определена
	Схема = Параметры.Зал.СхемаЗала.Схема.Получить();
	Если Схема <> Неопределено Тогда    
		//выводим полученную схему из Хранилища Значений
		СхемаЗала.Вывести(Схема);
		
	Иначе
		
		// Возможно добавить оповещение клиента о том, что что-то сломалось
		Возврат;
		
	КонецЕсли;
	
	Для н = 1 По Параметры.ВыбранныеМеста.Количество() Цикл
		
		МассивМеста = СтрРазделить(Параметры.ВыбранныеМеста[н-1], "|");  
		
		ТекОбл = СхемаЗала.Область(Число(МассивМеста[0]) + 2, Число(МассивМеста[1]) + 1);	
		ТекОбл.ЦветФона = Новый Цвет(212, 212, 44);
		
	КонецЦикла; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроданныеБилеты.Ряд КАК Ряд,
		|	ПроданныеБилеты.Место КАК Место,
		|	ПроданныеБилеты.Бронирование КАК Бронирование,
		|	ПроданныеБилеты.БронированиеВыкуплено КАК БронированиеВыкуплено
		|ИЗ
		|	РегистрСведений.ПроданныеБилеты КАК ПроданныеБилеты
		|ГДЕ
		|	ПроданныеБилеты.Кинотеатр = &Кинотеатр
		|	И ПроданныеБилеты.Зал = &Зал
		|	И ПроданныеБилеты.Фильм = &Фильм
		|	И ПроданныеБилеты.День = &День
		|	И ПроданныеБилеты.Время = &Время";
	
	Запрос.УстановитьПараметр("Время", Параметры.ВремяСеанса);
	Запрос.УстановитьПараметр("День", Параметры.ДатаСеанса);
	Запрос.УстановитьПараметр("Зал", Параметры.Зал);
	Запрос.УстановитьПараметр("Кинотеатр", Параметры.Кинотеатр);
	Запрос.УстановитьПараметр("Фильм", Параметры.Фильм);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекОбл = СхемаЗала.Область(Выборка.Ряд + 2, Выборка.Место + 1);
		Если ТекОбл <> Неопределено Тогда
			//находим по адресу данную ячейку и окрашиваем в зеленый цвет
			Если Выборка.Бронирование И Не Выборка.БронированиеВыкуплено Тогда
				ТекОбл.ЦветФона = Новый Цвет(51, 153, 102);
			Иначе
				ТекОбл.ЦветФона = Новый Цвет(255, 0, 255);
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СхемаЗалаВыбор(Элемент, Область, СтандартнаяОбработка)
	
	//Если Область.ЦветФона = Новый Цвет(255, 0, 255) Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Данное место уже выкуплено!";
	//	Сообщение.Сообщить(); 
	//	
	//	Возврат;
	//	
	//ИначеЕсли Область.ЦветФона = Новый Цвет(51, 153, 102) Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Данное место уже забронировано!";
	//	Сообщение.Сообщить();
	//	
	//	Возврат;
	//	
	//ИначеЕсли Область.ЦветФона = Новый Цвет(212, 212, 44) Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Вы уже выбрали данное место!";
	//	Сообщение.Сообщить();
	//	
	//	Возврат;
	//	
	//ИначеЕсли Область.ЦветФона <> Новый Цвет(153, 204, 255) Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Выбрана некорректная область!";
	//	Сообщение.Сообщить();
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	
	Если СтрНайти(Область.Имя, ":") Тогда // Если выбрали группу мест
		
		НачальныйРяд = Область.Верх;
		КонечныйРяд = Область.Низ;
		НачальноеМесто = Область.Лево;
		КонечныйМесто = Область.Право;
		
		Для нРяд = НачальныйРяд По КонечныйРяд Цикл
			
			Для нМесто = НачальноеМесто По КонечныйМесто Цикл
				
				тМесто = Строка(нРяд - 2) + "|" + Строка(нМесто - 1);
				ТекОбл = СхемаЗала.Область(нРяд, нМесто);	
				
				Если ТекОбл.ЦветФона = Новый Цвет(255, 0, 255) Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Место " + Строка(нРяд - 2) + "|" + Строка(нМесто - 1) + "уже выкуплено!";
					Сообщение.Сообщить(); 
					
					Продолжить;
					
				ИначеЕсли Область.ЦветФона = Новый Цвет(51, 153, 102) Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Место " + Строка(нРяд - 2) + "|" + Строка(нМесто - 1) + "уже забронировано!";
					Сообщение.Сообщить();
					
					Продолжить;
					
				ИначеЕсли Область.ЦветФона = Новый Цвет(212, 212, 44) Тогда
					
					тИндекс = -1;
					ИндексУдаления = -1;
					
					Для каждого СтрБилетов Из ВыбранныеМеста Цикл
						
						тИндекс = тИндекс + 1;
						
						Если СтрБилетов.Место = тМесто Тогда
							
							ИндексУдаления = тИндекс;
							
						КонецЕсли; 
						
					КонецЦикла; 
					
					Если ИндексУдаления <> -1 Тогда
						
						ВыбранныеМеста.Удалить(ИндексУдаления);	
						
					КонецЕсли; 
					
					Область.ЦветФона = Новый Цвет(153, 204, 255);
					
					Продолжить;
					
				ИначеЕсли Область.ЦветФона <> Новый Цвет(153, 204, 255) Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Выбрана некорректная область " + Строка(нРяд - 2) + "|" + Строка(нМесто - 1) + "!";
					Сообщение.Сообщить();
					
					Продолжить;
					
				Иначе
					ТекОбл.ЦветФона = Новый Цвет(212, 212, 44);
					
					НоваяСтрока = ВыбранныеМеста.Добавить();
					НоваяСтрока.Место = Строка(нРяд - 2) + "|" + Строка(нМесто - 1);	
				КонецЕсли; 
					
			КонецЦикла; 
			
		КонецЦикла; 
		
	Иначе // Если выбрали только одно место
		
		НачальныйРяд = Область.Верх;
		НачальноеМесто = Область.Лево;
		тМесто = Строка(НачальныйРяд - 2) + "|" + Строка(НачальноеМесто - 1);
		
		Если Область.ЦветФона = Новый Цвет(255, 0, 255) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данное место уже выкуплено!";
			Сообщение.Сообщить(); 
			
			Возврат;
			
		ИначеЕсли Область.ЦветФона = Новый Цвет(51, 153, 102) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данное место уже забронировано!";
			Сообщение.Сообщить();
			
			Возврат;
			
		ИначеЕсли Область.ЦветФона = Новый Цвет(212, 212, 44) Тогда
			
			тИндекс = -1;
			ИндексУдаления = -1;
			
			Для каждого СтрБилетов Из ВыбранныеМеста Цикл
				
				тИндекс = тИндекс + 1;
				
				Если СтрБилетов.Место = тМесто Тогда
					
					ИндексУдаления = тИндекс;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если ИндексУдаления <> -1 Тогда
				
				ВыбранныеМеста.Удалить(ИндексУдаления);	
				
			КонецЕсли; 
			
			Область.ЦветФона = Новый Цвет(153, 204, 255);
			
			Возврат;
			
		ИначеЕсли Область.ЦветФона <> Новый Цвет(153, 204, 255) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выбрана некорректная область!";
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		ТекОбл = СхемаЗала.Область(НачальныйРяд, НачальноеМесто);	
		ТекОбл.ЦветФона = Новый Цвет(212, 212, 44);
		НоваяСтрока = ВыбранныеМеста.Добавить();
		НоваяСтрока.Место = Строка(НачальныйРяд - 2) + "|" + Строка(НачальноеМесто - 1);
			
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьБилеты(Команда)
	
	МассивБилетов = Новый Массив;
	
	Для каждого Стр Из ВыбранныеМеста Цикл
		
		МассивБилетов.Добавить(Стр.Место);
		
	КонецЦикла; 
	
	Закрыть(МассивБилетов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеМестаМестоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.ВыбранныеМеста.ТекущийЭлемент.СписокВыбора.Очистить();
	
	Для нРяды = 3 По КоличествоРядов + 2 Цикл
		
		Для нМеста = 2 По КоличествоМест + 1 Цикл
			
			ТекОбл = СхемаЗала.Область(нРяды, нМеста);	
			
			Если ТекОбл.ЦветФона = Новый Цвет(153, 204, 255) Тогда
				
				РядМесто = Строка(нРяды - 2) + "|" + Строка(нМеста - 1);
				Элементы.ВыбранныеМеста.ТекущийЭлемент.СписокВыбора.Добавить(РядМесто); 
				
				Продолжить;
				
			КонецЕсли;
				
		КонецЦикла; 
		
	КонецЦикла; 
	
	Если Элементы.ВыбранныеМеста.Текущиеданные.Место <> "" Тогда
		ВыбранноеРанееМесто = Элементы.ВыбранныеМеста.Текущиеданные.Место;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеМестаМестоПриИзменении(Элемент)
	
	Если ВыбранноеРанееМесто <> "" Тогда
		
		МассивМестаПредыдущегоМеста = СтрРазделить(ВыбранноеРанееМесто, "|");;
	
		ТекОбл = СхемаЗала.Область(Число(МассивМестаПредыдущегоМеста[0]) + 2, Число(МассивМестаПредыдущегоМеста[1]) + 1);	
		ТекОбл.ЦветФона = Новый Цвет(153, 204, 255);
		
	КонецЕсли; 
	
	МассивМеста = СтрРазделить(Элемент.ТекстРедактирования, "|");;
	
	ТекОбл = СхемаЗала.Область(Число(МассивМеста[0]) + 2, Число(МассивМеста[1]) + 1);	
	ТекОбл.ЦветФона = Новый Цвет(212, 212, 44);
	
	ВыбранноеРанееМесто = "";

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеМестаПередУдалением(Элемент, Отказ)
	
	Если Элементы.ВыбранныеМеста.ТекущиеДанные.Место <> "" Тогда
		
		МассивМеста = СтрРазделить(Элементы.ВыбранныеМеста.ТекущиеДанные.Место, "|");;
		
		ТекОбл = СхемаЗала.Область(Число(МассивМеста[0]) + 2, Число(МассивМеста[1]) + 1);	
		ТекОбл.ЦветФона = Новый Цвет(153, 204, 255);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеМестаМестоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
